In [2]:
import pandas as pd
import numpy as np
pd.DataFrame({"Col1": [1,2,3,4]})
# DataFrame is a Two-Dimentional data structure

   Col1
0     1
1     2
2     3
3     4

In [4]:
pd.Series([1,2,3,np.nan,6,8])
# Series is a One-Dimentional labelled array

0    1.0
1    2.0
2    3.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range("20240401", periods=10)
dates

DatetimeIndex(['2024-04-01', '2024-04-02', '2024-04-03', '2024-04-04',
               '2024-04-05', '2024-04-06', '2024-04-07', '2024-04-08',
               '2024-04-09', '2024-04-10'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df = pd.DataFrame(np.random.randn(10,3),  columns=["Col1", "Col2", "Col3"])
df

       Col1      Col2      Col3
0 -0.596076 -0.971124 -0.484887
1 -0.088873  0.611731  0.521300
2 -0.247236  0.010979 -1.435192
3 -1.046075 -1.303277  0.062110
4 -1.066490  1.318000  1.023671
5 -0.300590  0.693984  0.552264
6  1.030176  0.211880  0.523895
7  0.045359 -0.882173 -0.169592
8  2.397975  0.485363  0.214933
9 -1.031787  0.494190 -0.758866

In [20]:
df.head(5)

       Col1      Col2      Col3
0 -0.596076 -0.971124 -0.484887
1 -0.088873  0.611731  0.521300
2 -0.247236  0.010979 -1.435192
3 -1.046075 -1.303277  0.062110
4 -1.066490  1.318000  1.023671

In [21]:
df.tail(5)

       Col1      Col2      Col3
5 -0.300590  0.693984  0.552264
6  1.030176  0.211880  0.523895
7  0.045359 -0.882173 -0.169592
8  2.397975  0.485363  0.214933
9 -1.031787  0.494190 -0.758866

In [22]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [23]:
df.columns

Index(['Col1', 'Col2', 'Col3'], dtype='object')

In [24]:
df.to_numpy()

array([[-0.59607585, -0.97112395, -0.48488726],
       [-0.088873  ,  0.61173057,  0.52130031],
       [-0.24723623,  0.01097919, -1.43519236],
       [-1.04607463, -1.3032773 ,  0.06211014],
       [-1.06649017,  1.31800026,  1.02367143],
       [-0.30059007,  0.69398383,  0.55226405],
       [ 1.03017581,  0.21188049,  0.52389497],
       [ 0.04535878, -0.8821732 , -0.16959206],
       [ 2.39797458,  0.48536308,  0.2149328 ],
       [-1.0317866 ,  0.49418975, -0.75886636]])

In [25]:
df.dtypes

Col1    float64
Col2    float64
Col3    float64
dtype: object

In [26]:
df.describe()

            Col1       Col2       Col3
count  10.000000  10.000000  10.000000
mean   -0.090362   0.066955   0.004964
std     1.082327   0.849364   0.733974
min    -1.066490  -1.303277  -1.435192
25%    -0.922859  -0.658885  -0.406063
50%    -0.273913   0.348622   0.138521
75%     0.011801   0.582345   0.523246
max     2.397975   1.318000   1.023671

In [30]:
df.T
# Transpose

,0,1,2,3,4,5,6,7,8,9
Col1,-0.596076,-0.088873,-0.247236,-1.046075,-1.066490,-0.300590,1.030176,0.045359,2.397975,-1.031787
Col2,-0.971124,0.611731,0.010979,-1.303277,1.318000,0.693984,0.211880,-0.882173,0.485363,0.494190
Col3,-0.484887,0.521300,-1.435192,0.062110,1.023671,0.552264,0.523895,-0.169592,0.214933,-0.758866

In [33]:
df.sort_values(by="Col2")

       Col1      Col2      Col3
3 -1.046075 -1.303277  0.062110
0 -0.596076 -0.971124 -0.484887
7  0.045359 -0.882173 -0.169592
2 -0.247236  0.010979 -1.435192
6  1.030176  0.211880  0.523895
8  2.397975  0.485363  0.214933
9 -1.031787  0.494190 -0.758866
1 -0.088873  0.611731  0.521300
5 -0.300590  0.693984  0.552264
4 -1.066490  1.318000  1.023671

In [34]:
df["Col1"]

0   -0.596076
1   -0.088873
2   -0.247236
3   -1.046075
4   -1.066490
5   -0.300590
6    1.030176
7    0.045359
8    2.397975
9   -1.031787
Name: Col1, dtype: float64

In [35]:
df["Col4"] = df["Col1"] + df["Col2"]
df

       Col1      Col2      Col3      Col4
0 -0.596076 -0.971124 -0.484887 -1.567200
1 -0.088873  0.611731  0.521300  0.522858
2 -0.247236  0.010979 -1.435192 -0.236257
3 -1.046075 -1.303277  0.062110 -2.349352
4 -1.066490  1.318000  1.023671  0.251510
5 -0.300590  0.693984  0.552264  0.393394
6  1.030176  0.211880  0.523895  1.242056
7  0.045359 -0.882173 -0.169592 -0.836814
8  2.397975  0.485363  0.214933  2.883338
9 -1.031787  0.494190 -0.758866 -0.537597

In [51]:
df[0:5]
# Start from 0th row and end with 5th Row. Here 5th Row has index 4

       Col1      Col2      Col3      Col4
0 -0.596076 -0.971124 -0.484887 -1.567200
1 -0.088873  0.611731  0.521300  0.522858
2 -0.247236  0.010979 -1.435192 -0.236257
3 -1.046075 -1.303277  0.062110 -2.349352
4 -1.066490  1.318000  1.023671  0.251510

In [49]:
df.iloc[0:5, 2]
# Select Rows along with columns

0   -0.484887
1    0.521300
2   -1.435192
3    0.062110
4    1.023671
Name: Col3, dtype: float64

In [53]:
df[df["Col1"] > 1]

       Col1      Col2      Col3      Col4
6  1.030176  0.211880  0.523895  1.242056
8  2.397975  0.485363  0.214933  2.883338

In [56]:
df[df > 0]

       Col1      Col2      Col3      Col4
0       NaN       NaN       NaN       NaN
1       NaN  0.611731  0.521300  0.522858
2       NaN  0.010979       NaN       NaN
3       NaN       NaN  0.062110       NaN
4       NaN  1.318000  1.023671  0.251510
5       NaN  0.693984  0.552264  0.393394
6  1.030176  0.211880  0.523895  1.242056
7  0.045359       NaN       NaN       NaN
8  2.397975  0.485363  0.214933  2.883338
9       NaN  0.494190       NaN       NaN

In [57]:
df1 = df

In [60]:
df1.mean()

Col1   -0.090362
Col2    0.066955
Col3    0.004964
Col4   -0.023406
dtype: float64

In [63]:
df.sum()

Col1   -0.903617
Col2    0.669553
Col3    0.049636
Col4   -0.234065
dtype: float64

In [64]:
df.count()

Col1    10
Col2    10
Col3    10
Col4    10
dtype: int64

In [65]:
df.groupby("Col4").sum()

               Col1      Col2      Col3
Col4
-2.349352 -1.046075 -1.303277  0.062110
-1.567200 -0.596076 -0.971124 -0.484887
-0.836814  0.045359 -0.882173 -0.169592
-0.537597 -1.031787  0.494190 -0.758866
-0.236257 -0.247236  0.010979 -1.435192
 0.251510 -1.066490  1.318000  1.023671
 0.393394 -0.300590  0.693984  0.552264
 0.522858 -0.088873  0.611731  0.521300
 1.242056  1.030176  0.211880  0.523895
 2.883338  2.397975  0.485363  0.214933

In [72]:
df1 = pd.DataFrame({"A": [1,2,3,4,5],
       "B": [4,3,5,3,2],
                   "Id": [1,1,2,3,2]})
df1

   A  B  Id
0  1  4   1
1  2  3   1
2  3  5   2
3  4  3   3
4  5  2   2

In [73]:
df1.groupby("Id").sum()

    A  B
Id
1   3  7
2   8  7
3   4  3